wrk2/baseline/100KB/wrk-eth3-rep04.log
Running 30s test @ https://bench-eth2.netdev-lab.org/100k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 4.818ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 4.934ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 4.880ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 4.873ms, rate sampling interval: 16ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.15ms    4.54ms 268.54ms   91.50%
    Req/Sec   230.45     54.98   466.00     79.24%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.17ms
 75.000%    6.18ms
 90.000%    9.02ms
 99.000%   16.56ms
 99.900%   31.52ms
 99.990%  174.34ms
 99.999%  268.80ms
100.000%  268.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.227     0.000000            1         1.00
       2.129     0.100000         1782         1.11
       2.791     0.200000         3559         1.25
       3.329     0.300000         5345         1.43
       3.765     0.400000         7124         1.67
       4.171     0.500000         8899         2.00
       4.379     0.550000         9797         2.22
       4.655     0.600000        10687         2.50
       5.063     0.650000        11573         2.86
       5.595     0.700000        12463         3.33
       6.175     0.750000        13348         4.00
       6.515     0.775000        13793         4.44
       6.859     0.800000        14238         5.00
       7.315     0.825000        14681         5.71
       7.823     0.850000        15126         6.67
       8.319     0.875000        15571         8.00
       8.615     0.887500        15796         8.89
       9.015     0.900000        16018        10.00
       9.559     0.912500        16238        11.43
      10.239     0.925000        16461        13.33
      11.079     0.937500        16683        16.00
      11.471     0.943750        16797        17.78
      12.023     0.950000        16906        20.00
      12.487     0.956250        17018        22.86
      12.975     0.962500        17128        26.67
      13.319     0.968750        17241        32.00
      13.479     0.971875        17297        35.56
      13.647     0.975000        17353        40.00
      13.943     0.978125        17407        45.71
      14.471     0.981250        17463        53.33
      14.999     0.984375        17517        64.00
      15.335     0.985938        17545        71.11
      15.615     0.987500        17573        80.00
      16.199     0.989062        17601        91.43
      16.815     0.990625        17629       106.67
      17.359     0.992188        17656       128.00
      17.647     0.992969        17671       142.22
      17.999     0.993750        17684       160.00
      18.383     0.994531        17698       182.86
      19.151     0.995313        17713       213.33
      19.727     0.996094        17726       256.00
      20.191     0.996484        17733       284.44
      20.655     0.996875        17741       320.00
      21.231     0.997266        17747       365.71
      21.871     0.997656        17754       426.67
      27.151     0.998047        17761       512.00
      27.695     0.998242        17764       568.89
      29.807     0.998437        17768       640.00
      30.399     0.998633        17772       731.43
      31.119     0.998828        17775       853.33
      33.247     0.999023        17778      1024.00
      33.727     0.999121        17780      1137.78
      34.943     0.999219        17782      1280.00
      35.583     0.999316        17784      1462.86
      35.935     0.999414        17785      1706.67
      36.447     0.999512        17787      2048.00
      36.831     0.999561        17788      2275.56
      37.311     0.999609        17789      2560.00
      37.311     0.999658        17789      2925.71
      40.767     0.999707        17790      3413.33
      69.055     0.999756        17791      4096.00
     137.087     0.999780        17792      4551.11
     137.087     0.999805        17792      5120.00
     137.087     0.999829        17792      5851.43
     174.335     0.999854        17793      6826.67
     174.335     0.999878        17793      8192.00
     243.199     0.999890        17794      9102.22
     243.199     0.999902        17794     10240.00
     243.199     0.999915        17794     11702.86
     243.199     0.999927        17794     13653.33
     243.199     0.999939        17794     16384.00
     268.799     0.999945        17795     18204.44
     268.799     1.000000        17795          inf
#[Mean    =        5.149, StdDeviation   =        4.537]
#[Max     =      268.544, Total count    =        17795]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  26848 requests in 30.00s, 2.57GB read
Requests/sec:    894.82
Transfer/sec:     87.61MB