wrk2/baseline/100KB/wrk-eth3-rep06.log
Running 30s test @ https://bench-eth2.netdev-lab.org/100k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 12.778ms, rate sampling interval: 73ms
  Thread calibration: mean lat.: 12.631ms, rate sampling interval: 74ms
  Thread calibration: mean lat.: 13.206ms, rate sampling interval: 73ms
  Thread calibration: mean lat.: 32.525ms, rate sampling interval: 107ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.37ms   18.72ms 278.02ms   84.56%
    Req/Sec   224.41     55.64   347.00     60.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.68ms
 75.000%   29.41ms
 90.000%   42.01ms
 99.000%   57.66ms
 99.900%  245.89ms
 99.990%  260.86ms
 99.999%  278.27ms
100.000%  278.27ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.230     0.000000            1         1.00
       2.461     0.100000         1780         1.11
       3.209     0.200000         3560         1.25
       3.983     0.300000         5337         1.43
       7.731     0.400000         7117         1.67
      11.679     0.500000         8895         2.00
      16.351     0.550000         9786         2.22
      19.167     0.600000        10675         2.50
      23.391     0.650000        11564         2.86
      27.199     0.700000        12454         3.33
      29.407     0.750000        13343         4.00
      31.295     0.775000        13791         4.44
      33.471     0.800000        14247         5.00
      35.647     0.825000        14684         5.71
      37.407     0.850000        15122         6.67
      39.583     0.875000        15567         8.00
      41.023     0.887500        15793         8.89
      42.015     0.900000        16016        10.00
      43.583     0.912500        16234        11.43
      45.439     0.925000        16459        13.33
      46.879     0.937500        16681        16.00
      47.615     0.943750        16793        17.78
      48.479     0.950000        16904        20.00
      49.599     0.956250        17013        22.86
      50.719     0.962500        17128        26.67
      51.519     0.968750        17237        32.00
      52.191     0.971875        17290        35.56
      53.407     0.975000        17347        40.00
      54.111     0.978125        17402        45.71
      54.719     0.981250        17462        53.33
      55.295     0.984375        17513        64.00
      56.031     0.985938        17540        71.11
      56.863     0.987500        17568        80.00
      57.311     0.989062        17596        91.43
      58.079     0.990625        17624       106.67
      59.103     0.992188        17652       128.00
      60.159     0.992969        17665       142.22
      60.671     0.993750        17680       160.00
      61.279     0.994531        17693       182.86
      62.143     0.995313        17707       213.33
      63.999     0.996094        17721       256.00
      64.863     0.996484        17728       284.44
      68.671     0.996875        17735       320.00
      98.751     0.997266        17742       365.71
     149.119     0.997656        17749       426.67
     168.831     0.998047        17757       512.00
     169.983     0.998242        17759       568.89
     172.927     0.998437        17763       640.00
     177.151     0.998633        17766       731.43
     242.687     0.998828        17770       853.33
     248.703     0.999023        17773      1024.00
     249.215     0.999121        17775      1137.78
     250.367     0.999219        17778      1280.00
     250.367     0.999316        17778      1462.86
     254.463     0.999414        17780      1706.67
     256.511     0.999512        17782      2048.00
     256.639     0.999561        17784      2275.56
     256.639     0.999609        17784      2560.00
     256.639     0.999658        17784      2925.71
     256.767     0.999707        17786      3413.33
     256.767     0.999756        17786      4096.00
     257.535     0.999780        17787      4551.11
     257.535     0.999805        17787      5120.00
     257.535     0.999829        17787      5851.43
     260.863     0.999854        17788      6826.67
     260.863     0.999878        17788      8192.00
     269.823     0.999890        17789      9102.22
     269.823     0.999902        17789     10240.00
     269.823     0.999915        17789     11702.86
     269.823     0.999927        17789     13653.33
     269.823     0.999939        17789     16384.00
     278.271     0.999945        17790     18204.44
     278.271     1.000000        17790          inf
#[Mean    =       18.373, StdDeviation   =       18.723]
#[Max     =      278.016, Total count    =        17790]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  26635 requests in 30.06s, 2.55GB read
Requests/sec:    886.07
Transfer/sec:     86.77MB