wrk2/baseline/100KB/wrk-wlan0-rep04.log
Running 30s test @ https://bench-eth2.netdev-lab.org/100k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 26.595ms, rate sampling interval: 74ms
  Thread calibration: mean lat.: 37.793ms, rate sampling interval: 163ms
  Thread calibration: mean lat.: 39.424ms, rate sampling interval: 197ms
  Thread calibration: mean lat.: 26.443ms, rate sampling interval: 63ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    29.39ms   54.67ms 907.78ms   91.15%
    Req/Sec   180.38     44.44   382.00     76.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.64ms
 75.000%   23.57ms
 90.000%   39.49ms
 99.000%  242.69ms
 99.900%  457.21ms
 99.990%  773.12ms
 99.999%  908.29ms
100.000%  908.29ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.291     0.000000            1         1.00
       5.067     0.100000         1435         1.11
       5.967     0.200000         2862         1.25
       7.615     0.300000         4292         1.43
      10.327     0.400000         5719         1.67
      12.639     0.500000         7152         2.00
      14.071     0.550000         7866         2.22
      16.071     0.600000         8579         2.50
      18.287     0.650000         9295         2.86
      20.767     0.700000        10009         3.33
      23.567     0.750000        10725         4.00
      25.199     0.775000        11083         4.44
      26.783     0.800000        11442         5.00
      28.399     0.825000        11799         5.71
      30.127     0.850000        12155         6.67
      32.799     0.875000        12510         8.00
      34.815     0.887500        12689         8.89
      39.519     0.900000        12868        10.00
      85.823     0.912500        13047        11.43
      98.175     0.925000        13225        13.33
     121.343     0.937500        13404        16.00
     131.199     0.943750        13493        17.78
     151.935     0.950000        13583        20.00
     217.087     0.956250        13672        22.86
     221.183     0.962500        13762        26.67
     225.279     0.968750        13853        32.00
     226.687     0.971875        13896        35.56
     228.479     0.975000        13941        40.00
     231.295     0.978125        13988        45.71
     233.599     0.981250        14030        53.33
     236.031     0.984375        14076        64.00
     237.951     0.985938        14096        71.11
     239.871     0.987500        14119        80.00
     241.791     0.989062        14144        91.43
     243.455     0.990625        14163       106.67
     246.015     0.992188        14186       128.00
     248.831     0.992969        14197       142.22
     253.951     0.993750        14208       160.00
     258.943     0.994531        14220       182.86
     267.007     0.995313        14231       213.33
     312.063     0.996094        14242       256.00
     324.863     0.996484        14247       284.44
     328.191     0.996875        14253       320.00
     330.751     0.997266        14258       365.71
     335.359     0.997656        14264       426.67
     345.855     0.998047        14270       512.00
     347.903     0.998242        14272       568.89
     437.503     0.998437        14275       640.00
     442.111     0.998633        14278       731.43
     452.607     0.998828        14281       853.33
     457.215     0.999023        14284      1024.00
     457.471     0.999121        14285      1137.78
     457.983     0.999219        14286      1280.00
     460.287     0.999316        14288      1462.86
     460.543     0.999414        14289      1706.67
     462.079     0.999512        14291      2048.00
     462.079     0.999561        14291      2275.56
     470.527     0.999609        14292      2560.00
     507.391     0.999658        14293      2925.71
     507.391     0.999707        14293      3413.33
     536.575     0.999756        14294      4096.00
     536.575     0.999780        14294      4551.11
     636.415     0.999805        14295      5120.00
     636.415     0.999829        14295      5851.43
     636.415     0.999854        14295      6826.67
     773.119     0.999878        14296      8192.00
     773.119     0.999890        14296      9102.22
     773.119     0.999902        14296     10240.00
     773.119     0.999915        14296     11702.86
     773.119     0.999927        14296     13653.33
     908.287     0.999939        14297     16384.00
     908.287     1.000000        14297          inf
#[Mean    =       29.392, StdDeviation   =       54.671]
#[Max     =      907.776, Total count    =        14297]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  21410 requests in 30.03s, 2.05GB read
Requests/sec:    712.90
Transfer/sec:     69.81MB